In [8]:
import pandas as pd
import numpy as np

In [9]:
pd.__version__

'2.2.0'

In [10]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : f538741432edf55c6b9fb5d0d496d2dd1d7c2457
python                : 3.12.1.final.0
python-bits           : 64
OS                    : Windows
OS-release            : 10
Version               : 10.0.19045
machine               : AMD64
processor             : AMD64 Family 23 Model 24 Stepping 1, AuthenticAMD
byteorder             : little
LC_ALL                : None
LANG                  : None
LOCALE                : English_Austria.1252

pandas                : 2.2.0
numpy                 : 1.26.3
pytz                  : 2023.3.post1
dateutil              : 2.8.2
setuptools            : None
pip                   : 23.3.2
Cython                : None
pytest                : None
hypothesis            : None
sphinx                : None
blosc                 : None
feather               : None
xlsxwriter            : None
lxml.etree            : None
html5lib              : None
pymysql               : None
psycopg2              : None
jinja2                : 3.1.3
IPython               : 8.20.0
pandas_datareader     : None
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : 4.12.3
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
gcsfs                 : None
matplotlib            : None
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : None
pandas_gbq            : None
pyarrow               : 15.0.0
pyreadstat            : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : None
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
zstandard             : None
tzdata                : 2023.4
qtpy                  : None
pyqt5                 : None

In [11]:
df = pd.DataFrame({'col one':[100,200], "col two":[300,400]})

In [12]:
df

   col one  col two
0      100      300
1      200      400

In [13]:
pd.DataFrame(np.random.rand(4,8))

,0,1,2,3,4,5,6,7
0,0.469475,0.338401,0.963390,0.777430,0.688932,0.772255,0.141614,0.221666
1,0.920433,0.100499,0.618650,0.370335,0.424280,0.563142,0.768343,0.952496
2,0.783405,0.467331,0.398022,0.863813,0.035006,0.509506,0.327534,0.944332
3,0.284477,0.450979,0.643164,0.384535,0.618763,0.026359,0.626730,0.052315

In [14]:
pd.DataFrame(np.random.rand(4,8), columns = list("abcdefgh"))

,a,b,c,d,e,f,g,h
0,0.947744,0.556117,0.209011,0.232590,0.408115,0.888530,0.406847,0.105818
1,0.176320,0.589653,0.193273,0.754742,0.309098,0.421307,0.830766,0.166540
2,0.811325,0.616647,0.186278,0.216704,0.113196,0.833600,0.580969,0.055870
3,0.730522,0.919611,0.038788,0.923675,0.083586,0.079894,0.733785,0.354210

In [12]:
df

   col one  col two
0      100      300
1      200      400

In [14]:
df = df.rename ({"col one":"col_one", "col two":"col_two"}, axis = "columns")

In [15]:
df

   col_one  col_two
0      100      300
1      200      400

In [21]:
df.columns = ["two_1", "one_2"]

In [22]:
df

   two_1  one_2
0    100    300
1    200    400

In [23]:
df.columns = df.columns.str.replace("_"," ")

In [24]:
df

   two 1  one 2
0    100    300
1    200    400

In [25]:
df.columns

Index(['two 1', 'one 2'], dtype='object')

In [26]:
df.add_prefix("1_")

   1_two 1  1_one 2
0      100      300
1      200      400

In [27]:
df.add_suffix("_2")

   two 1_2  one 2_2
0      100      300
1      200      400

In [30]:
df.head()

   two 1  one 2
0    100    300
1    200    400

In [33]:
df = pd.DataFrame(np.random.rand(9,8))

In [34]:
df

,0,1,2,3,4,5,6,7
0,0.319375,0.211151,0.307321,0.887878,0.422942,0.482769,0.415980,0.117087
1,0.329021,0.266540,0.981165,0.817908,0.967084,0.385934,0.615156,0.786514
2,0.856544,0.602758,0.795521,0.257041,0.135976,0.738670,0.475093,0.461300
3,0.227699,0.578723,0.190942,0.290161,0.758201,0.135074,0.729262,0.331420
4,0.794499,0.209055,0.267051,0.313737,0.256997,0.155814,0.596209,0.308973
5,0.153159,0.641485,0.419093,0.175184,0.448709,0.725351,0.470325,0.470911
6,0.382336,0.466872,0.617337,0.976295,0.343765,0.989075,0.239144,0.057186
7,0.582481,0.629225,0.975666,0.973899,0.212771,0.122377,0.723293,0.030343
8,0.997032,0.058634,0.648657,0.820352,0.535072,0.117568,0.640522,0.506235

In [36]:
df.loc[::-1].head()

,0,1,2,3,4,5,6,7
8,0.997032,0.058634,0.648657,0.820352,0.535072,0.117568,0.640522,0.506235
7,0.582481,0.629225,0.975666,0.973899,0.212771,0.122377,0.723293,0.030343
6,0.382336,0.466872,0.617337,0.976295,0.343765,0.989075,0.239144,0.057186
5,0.153159,0.641485,0.419093,0.175184,0.448709,0.725351,0.470325,0.470911
4,0.794499,0.209055,0.267051,0.313737,0.256997,0.155814,0.596209,0.308973

In [37]:
df.loc[::-1].reset_index(drop=True).head()

,0,1,2,3,4,5,6,7
0,0.997032,0.058634,0.648657,0.820352,0.535072,0.117568,0.640522,0.506235
1,0.582481,0.629225,0.975666,0.973899,0.212771,0.122377,0.723293,0.030343
2,0.382336,0.466872,0.617337,0.976295,0.343765,0.989075,0.239144,0.057186
3,0.153159,0.641485,0.419093,0.175184,0.448709,0.725351,0.470325,0.470911
4,0.794499,0.209055,0.267051,0.313737,0.256997,0.155814,0.596209,0.308973

In [38]:
df.loc[:,::-1].head()

,7,6,5,4,3,2,1,0
0,0.117087,0.415980,0.482769,0.422942,0.887878,0.307321,0.211151,0.319375
1,0.786514,0.615156,0.385934,0.967084,0.817908,0.981165,0.266540,0.329021
2,0.461300,0.475093,0.738670,0.135976,0.257041,0.795521,0.602758,0.856544
3,0.331420,0.729262,0.135074,0.758201,0.290161,0.190942,0.578723,0.227699
4,0.308973,0.596209,0.155814,0.256997,0.313737,0.267051,0.209055,0.794499

In [39]:
df.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
5    float64
6    float64
7    float64
dtype: object

In [41]:
df.select_dtypes(include = "number").head()

,0,1,2,3,4,5,6,7
0,0.319375,0.211151,0.307321,0.887878,0.422942,0.482769,0.415980,0.117087
1,0.329021,0.266540,0.981165,0.817908,0.967084,0.385934,0.615156,0.786514
2,0.856544,0.602758,0.795521,0.257041,0.135976,0.738670,0.475093,0.461300
3,0.227699,0.578723,0.190942,0.290161,0.758201,0.135074,0.729262,0.331420
4,0.794499,0.209055,0.267051,0.313737,0.256997,0.155814,0.596209,0.308973

In [42]:
df.select_dtypes(include = "object").head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [44]:
df.select_dtypes(include = ["number", "object"]).head()

,0,1,2,3,4,5,6,7
0,0.319375,0.211151,0.307321,0.887878,0.422942,0.482769,0.415980,0.117087
1,0.329021,0.266540,0.981165,0.817908,0.967084,0.385934,0.615156,0.786514
2,0.856544,0.602758,0.795521,0.257041,0.135976,0.738670,0.475093,0.461300
3,0.227699,0.578723,0.190942,0.290161,0.758201,0.135074,0.729262,0.331420
4,0.794499,0.209055,0.267051,0.313737,0.256997,0.155814,0.596209,0.308973

In [45]:
df.select_dtypes(exclude = "number").head()

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [47]:
df = pd.DataFrame({"col_one":["1.1", '2.2', '3.3'],
                   'col_two':['4.4', '5.5', '6.6'],
                   'col_three':['7.7', '8.8', '-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [48]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [49]:
df.astype({'col_one':"float", "col_two" : "float"}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [51]:
pd.to_numeric(df.col_three, errors="coerce")

0    7.7
1    8.8
2    NaN
Name: col_three, dtype: float64

In [52]:
pd.to_numeric(df.col_three, errors="coerce").fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [54]:
df = df.apply(pd.to_numeric, errors = "coerce").fillna(0)
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

In [56]:
df.dtypes

col_one      float64
col_two      float64
col_three    float64
dtype: object

In [15]:
drinks = pd.read_csv("C:/Users/Ivanov_Ivan/Desktop/Pandas-demo/gg/drinks.csv")

In [16]:
drinks.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 27.5 KB

In [18]:
cols = ['beer_servings','continent']
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols)
small_drinks.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 12.2 KB

In [20]:
dtypes = {"continent":"category"}
smaller_drinks = pd.read_csv("http://bit.ly/drinksbycountry", usecols=cols,dtype=dtypes)
smaller_drinks.info(memory_usage="deep")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.3 KB

In [23]:
pd.read_csv("C:/Users/Ivanov_Ivan/Desktop/Pandas-demo/gg/stocks1.csv")

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT

In [24]:
pd.read_csv("C:/Users/Ivanov_Ivan/Desktop/Pandas-demo/gg/stocks2.csv")

         Date   Close    Volume Symbol
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO

In [25]:
pd.read_csv("C:/Users/Ivanov_Ivan/Desktop/Pandas-demo/gg/stocks3.csv")

         Date   Close    Volume Symbol
0  2016-10-05   57.64  16726400   MSFT
1  2016-10-05   31.59  11808600   CSCO
2  2016-10-05  113.05  21453100   AAPL

In [26]:
from glob import glob

In [27]:
stock_files = sorted(glob("C:/Users/Ivanov_Ivan/Desktop/Pandas-demo/gg/stocks*.csv"))
stock_files

['C:/Users/Ivanov_Ivan/Desktop/Pandas-demo/gg\\stocks1.csv',
 'C:/Users/Ivanov_Ivan/Desktop/Pandas-demo/gg\\stocks2.csv',
 'C:/Users/Ivanov_Ivan/Desktop/Pandas-demo/gg\\stocks3.csv']

In [29]:
pd.concat(pd.read_csv(file) for file in stock_files)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO
0  2016-10-05   57.64  16726400   MSFT
1  2016-10-05   31.59  11808600   CSCO
2  2016-10-05  113.05  21453100   AAPL

In [31]:
pd.concat((pd.read_csv(file) for file in stock_files), ignore_index = True)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [32]:
pd.read_csv("C:gg/drinks1.csv").head()

       country  beer_servings  spirit_servings
0  Afghanistan              0                0
1      Albania             89              132
2      Algeria             25                0
3      Andorra            245              138
4       Angola            217               57

In [33]:
pd.read_csv("C:gg/drinks2.csv").head()

   wine_servings  total_litres_of_pure_alcohol continent
0              0                           0.0      Asia
1             54                           4.9    Europe
2             14                           0.7    Africa
3            312                          12.4    Europe
4             45                           5.9    Africa

In [34]:
drink_files = sorted(glob("C:gg/drinks*.csv"))

In [38]:
pd.concat((pd.read_csv(file) for file in drink_files), axis="columns").head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa,Angola,217,57,45,5.9,Africa

In [41]:
df = pd.read_clipboard()

In [42]:
df

,Erlang,Go,Python
0,Office environment or company culture,How widely used or impactful my work output wo...,Inadequate access to necessary tools
1,Python,R,"SQL,C#"
2,NaN,NaN,NaN

In [43]:
df.dtypes

Erlang    object
Go        object
Python    object
dtype: object

In [44]:
df = pd.read_clipboard()
df

  Engineer, site reliability Engineering manager   Senior executive/VP
0                        NaN                 NaN                   NaN
1                          C                 C++                    C#
2                WebAssembly   Other(s):,MongoDB  Microsoft SQL Server

In [45]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [83]:
movies = pd.read_csv("C:gg/imdb_1000.csv")

In [84]:
len(movies)

979

In [85]:
movies_1 = movies.sample(frac=0.75, random_state=1234)

In [87]:
movies_2 = movies.drop(movies_1.index)

In [88]:
len(movies_1) + len(movies_2)

979

In [91]:
movies_1.index.sort_values()

Index([  0,   2,   5,   6,   7,   8,   9,  11,  13,  16,
       ...
       966, 967, 969, 971, 972, 974, 975, 976, 977, 978],
      dtype='int64', length=734)

In [92]:
movies_2.index.sort_values()

Index([  1,   3,   4,  10,  12,  14,  15,  18,  26,  30,
       ...
       931, 934, 937, 941, 950, 954, 960, 968, 970, 973],
      dtype='int64', length=245)

In [93]:
movies.head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [94]:
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [96]:
movies[(movies.genre == "Action") |
       (movies.genre == "Drama") |
       (movies.genre == "Western")].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."

In [97]:
movies[movies.genre.isin(["Action", "Drama", "Western"])].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."

In [98]:
movies[-movies.genre.isin(["Action", "Drama", "Western"])].head()

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."

In [99]:
counts = movies.genre.value_counts()
counts

genre
Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Sci-Fi         5
Thriller       5
Film-Noir      3
Family         2
History        1
Fantasy        1
Name: count, dtype: int64

In [100]:
counts.nlargest(3)

genre
Drama     278
Comedy    156
Action    136
Name: count, dtype: int64

In [101]:
counts.nlargest(3).index

Index(['Drama', 'Comedy', 'Action'], dtype='object', name='genre')

In [105]:
movies[movies.genre.isin(counts.nlargest(3).index)].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."

In [112]:
ufo = pd.read_csv("C:gg/ufo.csv")

In [113]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [115]:
ufo.isna().sum()

City                  26
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [116]:
ufo.isna().mean()

City               0.001425
Colors Reported    0.842004
Shape Reported     0.144948
State              0.000000
Time               0.000000
dtype: float64

In [117]:
ufo.dropna(axis="columns").head()

  State             Time
0    NY   6/1/1930 22:00
1    NJ  6/30/1930 20:00
2    CO  2/15/1931 14:00
3    KS   6/1/1931 13:00
4    NY  4/18/1933 19:00

In [118]:
ufo.dropna(thresh=len(ufo)*0.9, axis="columns").head()

                   City State             Time
0                Ithaca    NY   6/1/1930 22:00
1           Willingboro    NJ  6/30/1930 20:00
2               Holyoke    CO  2/15/1931 14:00
3               Abilene    KS   6/1/1931 13:00
4  New York Worlds Fair    NY  4/18/1933 19:00

In [131]:
df = pd.DataFrame({"name":["John Artur Doe", "Jane Ann Smith"],
                   "location":["Los Angeles, CA", "Washington, DC"]})
df

             name         location
0  John Artur Doe  Los Angeles, CA
1  Jane Ann Smith   Washington, DC

In [132]:
df.name.str.split(" ", expand=True)

      0      1      2
0  John  Artur    Doe
1  Jane    Ann  Smith

In [133]:
df[["first", "middle", "last"]] = df.name.str.split(" ", expand = True)
df

             name         location first middle   last
0  John Artur Doe  Los Angeles, CA  John  Artur    Doe
1  Jane Ann Smith   Washington, DC  Jane    Ann  Smith

In [134]:
df.location.str.split(", ", expand=True)

             0   1
0  Los Angeles  CA
1   Washington  DC

In [135]:
df["city"] = df.location.str.split(", ", expand=True)[0]

In [136]:
df

             name         location first middle   last         city
0  John Artur Doe  Los Angeles, CA  John  Artur    Doe  Los Angeles
1  Jane Ann Smith   Washington, DC  Jane    Ann  Smith   Washington

In [137]:
df = pd.DataFrame({"col_one":['a', 'b', 'c'], 'col_two':[[10,40],[20,50],[30,60]]})

In [138]:
df

  col_one   col_two
0       a  [10, 40]
1       b  [20, 50]
2       c  [30, 60]

In [139]:
df_new = df.col_two.apply(pd.Series)
df_new

    0   1
0  10  40
1  20  50
2  30  60

In [142]:
pd.concat([df, df_new], axis='columns')

  col_one   col_two   0   1
0       a  [10, 40]  10  40
1       b  [20, 50]  20  50
2       c  [30, 60]  30  60